# Pandas

In [5]:
import pandas as pd

In [ ]:
pip show pandas

column = series

## Series

### From a list

In [30]:
list1  = [1,3,5,10,100]
pd.Series(list1)

0      1
1      3
2      5
3     10
4    100
dtype: int64

In [12]:
list2 = ['A','B','C','D']
series1 = pd.Series(list2)
print(type(series1))

<class 'pandas.core.series.Series'>

### setting custom index

In [48]:
index_list = ['aa','bb','cc','dd']
series = pd.Series(list2,index = index_list)
print(series)

aa    A
bb    B
cc    C
dd    D
dtype: object

### From dictionaries

In [20]:
dict1 = {
    'Name': "a",
    'roll': 3
}

print(pd.Series(dict1))

Name    a
roll    3
dtype: object

### From numpy array

In [40]:
import numpy as np
nparr = np.array([1,2,3,4,5])

np_series = pd.Series(nparr)
print(np_series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Get the Index

In [24]:
series.index

Index(['aa', 'bb', 'cc', 'dd'], dtype='object')

### Get values

In [ ]:
series.values

### shape and size

In [26]:
series.shape

(4,)

In [27]:
series.size

4

***METHODS List***

In [ ]:
dir(pd.Series)

### index and slicing

In [42]:
series['aa']

'A'

In [31]:
series[['aa','bb']]

aa    A
bb    B
dtype: object

In [49]:
series[['aa','bb']] = [1,2]
series

aa    1
bb    2
cc    C
dd    D
dtype: object

### remove an elem

In [53]:
series.drop('dd')
print(series)

aa    1
bb    2
cc    C
dd    D
dtype: object

In [55]:
list4 = [1,2,3,4,5]
seriesX = pd.Series(list4,index=['a','b','c','d','e'])
seriesX

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [56]:
seriesX.drop('a')

b    2
c    3
d    4
e    5
dtype: int64

## Dataframe

In [57]:
## creating dataframe

In [64]:
Name = ['Ishat','Noor','Mahi']
Age = [12,223,1]
Inc = [12.3,34,55]
dict1 = {
    'Name':Name,
    'Age': Age,
    'Income': Inc
}
print(dict1)

{'Name': ['Ishat', 'Noor', 'Mahi'], 'Age': [12, 223, 1], 'Income': [12.3, 34, 55]}

In [65]:
df = pd.DataFrame(dict1)
print(df)

    Name  Age  Income
0  Ishat   12    12.3
1   Noor  223    34.0
2   Mahi    1    55.0

In [62]:
# changing df index

In [67]:
df1 = pd.DataFrame(dict1,index=['A','B','C'])
print(df1)

    Name  Age  Income
A  Ishat   12    12.3
B   Noor  223    34.0
C   Mahi    1    55.0

In [78]:
lis = [i for i in range(1,len(dict1))]
print(lis)

[1, 2]

In [80]:
d1 ={'Name': 'Alice', 'Age': 28, 'Income': 54000}
d2= {'Name': 'Bob', 'Age': 35, 'Income': 72000}
d3={'Name': 'Charlie', 'Age': 42, 'Income': 88000}
d4={'Name': 'Diana', 'Age': 31, 'Income': 61000}

list3 = [d1,d2,d3,d4]

In [81]:
df3 = pd.DataFrame(list3)
print(df3)

      Name  Age  Income
0    Alice   28   54000
1      Bob   35   72000
2  Charlie   42   88000
3    Diana   31   61000

### from Numpy array

In [82]:
arr5 = [[1,2,3,4],
        [5,6,7,8],
        [9,10,11,12]]

In [84]:
np_arr2=np.array(arr5)

In [86]:
pd.DataFrame(np_arr2,columns = [1,2,3,4])

   1   2   3   4
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [ ]:
name = pd.Series(['Alice', 'Bob', 'Charlie'])
age = pd.Series([25, 30, 35])
income = pd.Series([50000, 60000, 70000])

#make a dict
#make df

In [89]:

print("Shape:", df.shape)         # (rows, columns)
print("Size:", df.size)           # total number of elements
print("Columns:", df.columns)     # column labels
print("Index:", df.index)         # row labels
print("Values:\n", df.values)     # underlying numpy array
print(df.axes)                    #

Shape: (3, 3)
Size: 9
Columns: Index(['Name', 'Age', 'Income'], dtype='object')
Index: RangeIndex(start=0, stop=3, step=1)
Values:
 [['Ishat' 12 12.3]
 ['Noor' 223 34.0]
 ['Mahi' 1 55.0]]
[RangeIndex(start=0, stop=3, step=1), Index(['Name', 'Age', 'Income'], dtype='object')]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Income  3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 204.0+ bytes
None

In [90]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Income  3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 204.0+ bytes
None

In [91]:
df.describe() #statistics for numerical series

              Age     Income
count    3.000000   3.000000
mean    78.666667  33.766667
std    125.117278  21.350956
min      1.000000  12.300000
25%      6.500000  23.150000
50%     12.000000  34.000000
75%    117.500000  44.500000
max    223.000000  55.000000

In [92]:
df.nunique()

Name      3
Age       3
Income    3
dtype: int64

In [99]:
df.sample(1)

    Name  Age  Income
0  Ishat   12    12.3

## adding droping or modifying columns

In [107]:
df.Age #or df['Age'] for multi-word col header
print(df.Age)
type(df.Age)

0     12
1    223
2      1
Name: Age, dtype: int64

pandas.core.series.Series

In [105]:
#multiple columns
print(df[['Age','Income']])
type(df[['Age','Income']])

   Age  Income
0   12    12.3
1  223    34.0
2    1    55.0

pandas.core.frame.DataFrame

In [108]:
df

    Name  Age  Income
0  Ishat   12    12.3
1   Noor  223    34.0
2   Mahi    1    55.0

In [109]:
# add new column
df['gender'] = ['M','M','M']
df

    Name  Age  Income gender
0  Ishat   12    12.3      M
1   Noor  223    34.0      M
2   Mahi    1    55.0      M

# hw : *add multiple series to DF*

In [120]:
df.loc[0:2,'Age']

0     12
1    223
2      1
Name: Age, dtype: int64

In [117]:

print(df.iloc[0:2]) #row wise print

    Name  Age  Income gender
0  Ishat   12    12.3      M
1   Noor  223    34.0      M

In [119]:
print(df.iloc[0:2,1])

0     12
1    223
Name: Age, dtype: int64

In [ ]:
#add new row

# working with Datasets

In [2]:
import pandas as pd

In [8]:
titanic = pd.read_csv("G:/PyNext/day 4/Datasets/titanic-cs.csv")

In [5]:
titanic

,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived
0,3rd,male,22.0,1,0,7.2500,No
1,1st,female,38.0,1,0,71.2833,Yes
2,3rd,female,26.0,0,0,7.9250,Yes
3,1st,female,35.0,1,0,53.1000,Yes
4,3rd,male,35.0,0,0,8.0500,No
...,...,...,...,...,...,...,...
882,2nd,male,27.0,0,0,13.0000,No
883,1st,female,19.0,0,0,30.0000,Yes
884,3rd,female,7.0,1,2,23.4500,No
885,1st,male,26.0,0,0,30.0000,Yes
886,3rd,male,32.0,0,0,7.7500,No

In [11]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Pclass                   887 non-null    object
 1   Sex                      887 non-null    object
 2   Age                      887 non-null    float64
 3   Siblings/Spouses Aboard  887 non-null    int64
 4   Parents/Children Aboard  887 non-null    int64
 5   Fare                     887 non-null    float64
 6   Survived                 887 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 48.6+ KB

In [12]:
titanic.describe()

              Age  Siblings/Spouses Aboard  Parents/Children Aboard       Fare
count  887.000000               887.000000               887.000000  887.00000
mean    29.471443                 0.525366                 0.383315   32.30542
std     14.121908                 1.104669                 0.807466   49.78204
min      0.420000                 0.000000                 0.000000    0.00000
25%     20.250000                 0.000000                 0.000000    7.92500
50%     28.000000                 0.000000                 0.000000   14.45420
75%     38.000000                 1.000000                 0.000000   31.13750
max     80.000000                 8.000000                 6.000000  512.32920

In [34]:
survived_df = titanic[(titanic['Survived'] == " Yes") & (titanic['Pclass'] == "1st") ]
survived_df

,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived
1,1st,female,38.0,1,0,71.2833,Yes
3,1st,female,35.0,1,0,53.1000,Yes
11,1st,female,58.0,0,0,26.5500,Yes
23,1st,male,28.0,0,0,35.5000,Yes
31,1st,female,48.0,1,0,146.5208,Yes
...,...,...,...,...,...,...,...
858,1st,female,48.0,0,0,25.9292,Yes
867,1st,female,47.0,1,1,52.5542,Yes
875,1st,female,56.0,0,1,83.1583,Yes
883,1st,female,19.0,0,0,30.0000,Yes
885,1st,male,26.0,0,0,30.0000,Yes

In [20]:
survived_df.describe()

,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,342.000000,342.000000,342.000000,342.000000
mean,28.408392,0.473684,0.464912,48.395408
std,14.427863,0.708688,0.771712,66.596998
min,0.420000,0.000000,0.000000,0.000000
25%,19.000000,0.000000,0.000000,12.475000
50%,28.000000,0.000000,0.000000,26.000000
75%,36.750000,1.000000,1.000000,57.000000
max,80.000000,4.000000,5.000000,512.329200

In [23]:
(titanic['Survived'] == " Yes").sum()

np.int64(342)

In [25]:
titanic.query('Age<25')

,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived
0,3rd,male,22.0,1,0,7.2500,No
7,3rd,male,2.0,3,1,21.0750,No
9,2nd,female,14.0,1,0,30.0708,Yes
10,3rd,female,4.0,1,1,16.7000,Yes
12,3rd,male,20.0,0,0,8.0500,No
...,...,...,...,...,...,...,...
873,3rd,male,19.0,0,0,7.8958,No
874,3rd,male,23.0,0,0,7.8958,No
878,3rd,female,22.0,0,0,10.5167,No
883,1st,female,19.0,0,0,30.0000,Yes
884,3rd,female,7.0,1,2,23.4500,No

In [27]:
titanic.where(titanic['Age']<25)

,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Survived
0,3rd,male,22.0,1.0,0.0,7.25,No
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
882,NaN,NaN,NaN,NaN,NaN,NaN,NaN
883,1st,female,19.0,0.0,0.0,30.00,Yes
884,3rd,female,7.0,1.0,2.0,23.45,No
885,NaN,NaN,NaN,NaN,NaN,NaN,NaN
886,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [35]:
titanic.columns

Index(['Pclass', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard', 'Fare', 'Survived'],
      dtype='object')

In [36]:
new_titanic = titanic[['Pclass','Age']]

In [40]:
new_titanic.rename(columns = {'Pclass':'Class'})

    Class   Age
0     3rd  22.0
1     1st  38.0
2     3rd  26.0
3     1st  35.0
4     3rd  35.0
..    ...   ...
882   2nd  27.0
883   1st  19.0
884   3rd   7.0
885   1st  26.0
886   3rd  32.0

[887 rows x 2 columns]

In [44]:
titanic.groupby("Sex")['Age'].count()

Sex
female    314
male      573
Name: Age, dtype: int64

In [ ]:
df.dropna() #drop the whole column that contains any Null value
titanic.sort_values(['Fair','Age'],ascending = False) #prioritize Age when same Fair